{
  "GNS103": {
    "name": "Information Literacy",
    "icon": "fa-book",
    "topics": {
      "library_concepts": {
        "name": "Library Concepts and Types",
        "content": "<h1>Library Concepts and Types</h1>\n\n<h2>Definition of the Library</h2>\n<p>A library is any place where information resources or materials are acquired, processed, organized, packaged, and disseminated to meet the information needs of users or clients. In Library and Information Science, users are also referred to as clients, which represents the clientele of the library.</p>\n\n<p>The word \"library\" comes from the Latin word <strong>\"liber\"</strong> meaning <strong>\"book\"</strong>.</p>\n\n<h2>Key Functions of the Library</h2>\n<p>Everything in library science revolves around five major functions:</p>\n\n<ol>\n<li><strong>Acquisition:</strong> Obtaining information materials such as books, journals, and other resources.</li>\n<li><strong>Processing:</strong> Cataloguing, classification, and preparation of materials for use.</li>\n<li><strong>Organization:</strong> Arranging materials systematically so they can be easily located.</li>\n<li><strong>Packaging:</strong> Preparing information in usable formats for users.</li>\n<li><strong>Dissemination:</strong> Making information available and accessible to users.</li>\n</ol>\n\n<p>If any of these functions is missing, the library's role is considered incomplete.</p>\n\n<h2>The Library as a Physical or Non-Physical Space</h2>\n<p>A library does not have to be confined to a building. It can exist in any organized space, including a corner of a student's room, provided the five major library functions are present.</p>\n\n<h2>Types of Libraries</h2>\n\n<h3>1. National Library</h3>\n<p>The National Library is the apex library of a country. It is expected to have at least one or two copies of every publication produced within the country, depending on policy. For instance, any material written about Nigeria should be deposited in the National Library of Nigeria.</p>\n\n<p><strong>Functions of the National Library:</strong></p>\n<ul>\n<li>Supervises and coordinates library activities nationwide</li>\n<li>Preserves national heritage</li>\n<li>Issues ISBN (International Standard Book Number) - a unique identification number assigned to books</li>\n<li>Issues ISSN (International Standard Serial Number) - a unique identification number assigned to serial publications such as journals and magazines</li>\n<li>Serves as a depository for all publications written about a country</li>\n<li>Publishes national bibliography</li>\n</ul>\n\n<p>National libraries are also known as <strong>depository libraries</strong>.</p>\n\n<h3>2. Public Library</h3>\n<p>Public libraries are established by state governments and are open to everyone within the state. They are not restricted to a particular profession, age group, or field of study.</p>\n\n<p><strong>Functions of Public Libraries:</strong></p>\n<ul>\n<li>Meet the information needs of people within a particular community</li>\n<li>Promote local culture</li>\n<li>Organize seminars, workshops, and programs for children</li>\n<li>Provide educational and recreational reading materials</li>\n<li>Ensure a conducive reading environment</li>\n</ul>\n\n<p>Ondo State Library Board is an example of a public library.</p>\n\n<h3>3. School Library</h3>\n<p>School libraries are found in primary and secondary schools.</p>\n\n<p><strong>Functions of School Libraries:</strong></p>\n<ul>\n<li>Support teachers and students in achieving curriculum objectives</li>\n<li>Provide supplementary textbooks and learning materials</li>\n<li>Offer recreational reading materials</li>\n<li>Help improve teachers' teaching skills</li>\n<li>Encourage reading habits among students</li>\n</ul>\n\n<h3>4. Academic Library</h3>\n<p>Academic libraries are found in tertiary institutions such as universities, polytechnics, colleges of education, and other higher institutions.</p>\n\n<p><strong>Users of Academic Libraries:</strong></p>\n<ul>\n<li>Students (undergraduate and postgraduate)</li>\n<li>Lecturers and faculty members</li>\n<li>Researchers</li>\n<li>Non-teaching staff</li>\n</ul>\n\n<p><strong>Functions of Academic Libraries:</strong></p>\n<ul>\n<li>Provision of academic resources that meet the academic needs of students and lecturers</li>\n<li>Provision of supplementary materials to support classroom learning</li>\n<li>Provide a conducive environment for reading, studying, and research</li>\n<li>Support the institutional mandate and help fulfill the vision and mission of parent institutions</li>\n<li>Practice user-centered library ethics - users should not be rejected</li>\n</ul>\n\n<p>The Federal University of Technology, Akure (FUTA) Library is an academic library. It was established in 1982 but was officially opened to users in <strong>1983</strong>. The library was relocated to its present site in <strong>April 2006</strong>. The FUTA Library is named after <strong>Albert Illemobade</strong>.</p>\n\n<h3>5. Special Library</h3>\n<p>Special libraries are usually established by organizations or institutions with specific objectives. Examples include libraries in research institutes, agricultural institutions, and corporate organizations.</p>\n\n<p><strong>Characteristics of Special Libraries:</strong></p>\n<ul>\n<li>Collections are limited to specific subject areas</li>\n<li>Libraries are usually small in size</li>\n<li>Materials are focused on fulfilling the goals of the parent organization</li>\n<li>They serve only the employees of the organization</li>\n</ul>\n\n<p><strong>Examples:</strong> International Institute of Tropical Agriculture (IITA) Library, Ibadan; Central Bank of Nigeria Library; Nigerian Institute of International Affairs Library; Shell Development Company Library; Federal Institute of Industrial Research Oshodi (FIIRO) Library.</p>\n\n<p><strong>Selective Dissemination of Information (SDI):</strong> This is a special service provided mainly in special and academic libraries. A researcher requests specific information; the librarian searches and selects relevant materials; information is provided quickly, especially when the user has limited time.</p>\n\n<h3>6. Private Library</h3>\n<p>Private libraries are owned by individuals or private organizations. Examples include libraries in churches, libraries in mosques, and personal libraries owned by individuals.</p>\n\n<h3>7. Electronic, Digital, and Virtual Libraries</h3>\n\n<p><strong>Electronic Library:</strong> Stores information in electronic formats such as CDs, hard drives, and databases. Access is usually through computers such as desktops or laptops, and materials may not exist in printed form.</p>\n\n<p><strong>Digital Library:</strong> Consists of books, journals, and papers stored and accessed digitally. Most digital libraries do not have physical books.</p>\n\n<p><strong>Virtual Library:</strong> Also known as a \"Library Without Walls.\" Accessed through the internet; can be used from anywhere (home, classroom, hostel); provides access to information from different parts of the world.</p>\n\n<h2>Archives</h2>\n<p>An archive is not strictly a library, but it is often discussed when studying types of libraries. An archive is a place where information materials of historical value are stored and preserved. A place housing a large number of historical records.</p>\n\n<p><strong>Materials found in Archives:</strong> Original documents, historical records, photographs and pictures, film and video recordings, audio recordings, real objects (similar to museum items).</p>\n\n<p><strong>Importance of Archives:</strong> They preserve the history of a country, organization, or institution; they help people understand how things were done in the past; they assist in planning and improving future actions.</p>\n\n<p><strong>Access and Security:</strong> Due to the sensitive nature of archival materials, access is restricted and security is very tight. Users must have genuine reasons and proper authorization.</p>"
      },
      "library_organization": {
        "name": "Library Organization and Units",
        "content": "<h1>Library Organization and Units</h1>\n\n<h2>Administrative Structure</h2>\n<p>In an academic library, such as the FUTA Library, the head of the library is the <strong>University Librarian</strong>. The University Librarian oversees all library activities, coordinates the operations of all units, and ensures that all functions align with the goals and objectives of the library.</p>\n\n<h2>Major Units in the Academic Library</h2>\n\n<h3>1. Acquisition Unit</h3>\n<p>The acquisition unit is responsible for acquiring information materials such as books and other resources. Without acquisition, a library cannot function effectively.</p>\n\n<p><strong>Importance:</strong> It handles the first major function of the library and ensures the continuous growth of library collections.</p>\n\n<p><strong>Methods of Acquiring Materials:</strong></p>\n<ul>\n<li><strong>Purchase:</strong> Buying materials from publishers or vendors</li>\n<li><strong>Gift/Donation:</strong> Receiving materials as gifts</li>\n<li><strong>Exchange:</strong> Swapping materials with other libraries</li>\n<li><strong>Bequest:</strong> Receiving materials through wills or inheritance</li>\n<li><strong>Inter-library loan:</strong> Borrowing materials from other libraries</li>\n<li><strong>Subscription:</strong> Paying for ongoing access to serials</li>\n</ul>\n\n<p><strong>Accessioning:</strong> Once materials are acquired, they are recorded in the accession register. Each book is given a unique <strong>accession number</strong>, which serves as its identification number. No two books in the library can have the same accession number, even if they are copies of the same title.</p>\n\n<p><strong>Functions of Accession Numbers:</strong> Identify library materials, prevent theft, determine the total number of books in the library.</p>\n\n<h3>2. Cataloguing and Classification Unit</h3>\n<p>After accessioning, books are transferred to the cataloguing and classification unit. This unit is responsible for describing and organizing materials for easy retrieval.</p>\n\n<p><strong>Cataloguing:</strong> The bibliographic description of information materials or resources in the library. It involves describing books in a systematic and technical manner so that users can easily identify them.</p>\n\n<p><strong>Elements of Bibliographic Description:</strong> Title of the book, name(s) of author(s), edition, year of publication, place of publication, publisher, imprint, number of pages.</p>\n\n<p><strong>Preliminary Pages:</strong> The pages at the beginning of a book numbered in Roman numerals. The main text pages are numbered using Arabic numerals.</p>\n\n<p><strong>Classification:</strong> The process of grouping information materials according to their subjects. It involves assigning specific numbers to books based on subject content.</p>\n\n<p><strong>Notation:</strong> The assignment of symbols or numbers to represent subjects. These numbers indicate where a book should be placed on the shelf.</p>\n\n<h3>Classification Schemes</h3>\n\n<p><strong>Library of Congress Classification (LCC):</strong> Academic libraries in Nigeria, including FUTA Library, use the Library of Congress Classification system. It was developed by the Library of Congress, the national library of the United States of America. It is divided into <strong>21 main classes</strong>.</p>\n\n<p><strong>Reasons for Using LCC:</strong> It accommodates many subject areas, it is flexible and expandable, it suits large academic libraries.</p>\n\n<p><strong>Components of LCC:</strong></p>\n<ul>\n<li><strong>Library of Congress Subject Headings (LCSH):</strong> Helps librarians determine the subject content of a book.</li>\n<li><strong>Library of Congress Schedules:</strong> Provides the subject number assigned to each subject area.</li>\n</ul>\n\n<p><strong>Dewey Decimal Classification (DDC):</strong> Used mainly by small libraries. In DDC, 300 represents Social Sciences.</p>\n\n<p><strong>LCC Class Letters:</strong></p>\n<ul>\n<li><strong>H:</strong> Social Sciences</li>\n<li><strong>J:</strong> Political Science</li>\n<li><strong>Q:</strong> Science</li>\n<li><strong>R:</strong> Medicine</li>\n<li><strong>S:</strong> Agriculture</li>\n<li><strong>T:</strong> Technology</li><li><strong>V:</strong> Naval Science</li></ul>\n\n<p><strong>Classification Number (Call Number):</strong> Formed by combining the subject number (from LC Schedules) and the author number (from Author Number Table). The author number represents the author's name and is added to the subject number to complete the classification number.</p>\n\n<p><strong>Other names for classification number:</strong> Call number, call mark, notation, shelf mark, classification mark.</p>\n\n<h3>3. Circulation Unit</h3>\n<p>The circulation unit is the first point of contact between the library and its users. It is the unit where users go to make inquiries and carry out basic library transactions.</p>\n\n<p><strong>Functions of the Circulation Unit:</strong></p>\n<ul>\n<li>Making inquiries - users ask questions and receive directions</li>\n<li>User registration - registering library users and explaining rules</li>\n<li>Lending and borrowing - handling borrowing and returning of books</li>\n<li>Clearance of students - at the end of a student's programme</li>\n<li>Charging and discharging of library materials</li>\n</ul>\n\n<p>Registration of library users takes place at the Circulation Unit.</p>\n\n<p><strong>Borrowing Limits at FUTA Library:</strong> Undergraduate students can borrow a maximum of <strong>2 books</strong> for a period of <strong>two weeks</strong>. Postgraduate students can borrow up to <strong>4 books</strong>.</p>\n\n<h3>4. Reference Unit</h3>\n<p>The reference unit houses reference materials that are meant only for consultation, not for borrowing. Reference materials are special information sources that are not read from cover to cover. They provide specific and factual information and are used to answer direct questions.</p>\n\n<p><strong>Reference Librarian:</strong> A specially trained librarian who works in the reference unit, assists users in locating information, provides factual and ready reference information, and directs users to appropriate reference sources.</p>\n\n<h3>5. Serials Unit</h3>\n<p>Serials are information materials that are published continuously at regular intervals. Examples include journals, magazines, and newspapers.</p>\n\n<p><strong>Importance of Serials:</strong> They contain current and up-to-date information, present latest research findings, and provide recent developments in various fields.</p>\n\n<p><strong>Kardex:</strong> A specialized catalogue used for serial collections. It is the index consulted by library staff to locate serial materials.</p>\n\n<h3>6. Audio-Visual Unit</h3>\n<p>Audio-visual materials are resources that appeal to sight and hearing. They include materials that users can watch, see, or listen to.</p>\n\n<p><strong>Types of Audio-Visual Materials:</strong> Pictures and photographs, video recordings, audio recordings, projected and non-projected materials.</p>\n\n<p><strong>Importance:</strong> They enhance understanding, help students grasp abstract concepts, aid memory retention, and support visual and auditory learners.</p>\n\n<h3>7. Electronic Resources Unit (ERS)</h3>\n<p>Provides access to electronic information both within and outside the library. Allows students and researchers to access desktop computers and online databases, retrieve electronic journals, e-books, and other digital resources, and connect to the internet and virtual libraries for research purposes.</p>\n\n<h3>8. Documents Unit</h3>\n<p>A specialized unit for preserving certain types of materials such as government publications, policy papers, reports from organizations, and official correspondence or archival materials.</p>\n\n<h3>9. Porters Unit</h3>\n<p>The first point of contact in the library for security and general order. Porters are responsible for ensuring the security of library resources, preventing theft, mutilation, or destruction of materials, maintaining order in reading rooms, and assisting students in general navigation within the library.</p>\n\n<h3>10. Publications and Repository Unit</h3>\n<p>This unit mainly stocks postgraduate dissertations and undergraduate projects.</p>\n\n<h2>Library Catalogues</h2>\n\n<p><strong>Manual Catalogue (Card Catalogue):</strong> Before computers, libraries used card catalogues to locate materials. These catalogues are usually kept in catalogue boxes. Cards in a catalogue cabinet are arranged alphabetically.</p>\n\n<p><strong>Types of Catalogue Entries:</strong> Author, Title, Subject. A book will have at least three catalogue cards (one for each access point).</p>\n\n<p><strong>Online Public Access Catalogue (OPAC):</strong> A computer-based system used to search for library materials. Access points in OPAC are Author, Title, and Subject. After searching through OPAC, users are provided with the classification number, which directs them to the exact shelf location of the book.</p>\n\n<p><strong>SLAM:</strong> The library software used in FUTA Library.</p>\n\n<h2>Shelving</h2>\n<p>Shelving is the process of arranging books on library shelves according to their classification numbers. After using a book, users are not expected to return it to the shelf. Library staff return books to the shelves through shelving.</p>"
      },
      "reference_sources": {
        "name": "Reference Sources and Services",
        "content": "<h1>Reference Sources and Services</h1>\n\n<h2>Reference Sources</h2>\n<p>Reference sources are special information sources in the library that provide factual, background, or basic information. They are not read from cover to cover but are consulted for specific information needs.</p>\n\n<p>Reference materials are meant only for consultation and cannot be borrowed. They must be used within the reference unit.</p>\n\n<h3>Types of Reference Sources</h3>\n\n<h4>1. Encyclopedias</h4>\n<p><strong>General Encyclopedias:</strong> Cover a wide range of subjects. Provide background information, definitions, and basic concepts. Examples: Encyclopedia Britannica, Encyclopedia Americana.</p>\n\n<p><strong>Subject Encyclopedias:</strong> Focus on a specific field of study. Examples: Encyclopedia of Biology, Encyclopedia of Genetic Engineering, Encyclopedia of Agriculture, Encyclopedia of Forestry.</p>\n\n<h4>2. Dictionaries</h4>\n<p><strong>General Dictionaries:</strong> Provide meanings, pronunciations (phonetic transcription), and usage of words. Examples: Oxford English Dictionary, Longman Contemporary English Dictionary.</p>\n\n<p><strong>Subject Dictionaries:</strong> Focus on terms in a particular field (e.g., medical, legal). Examples: Dictionary of Geology, Dictionary of African Culture, Dictionary of Proverbs.</p>\n\n<h4>3. Thesaurus (plural: Thesauri)</h4>\n<p>Provides synonyms and antonyms. Useful for students to vary their word choice when writing. Helps in improving vocabulary and avoiding repetition.</p>\n\n<h4>4. Indexes and Abstracts</h4>\n<p><strong>Indexes:</strong> A list of keywords or subjects found in a text. Can be part of a book or a separate volume. Helps locate information quickly within a text. A typical example of an index is the library catalogue.</p>\n\n<p><strong>Abstracts:</strong> Provide a summary of content of a work. Include author, title, and key information. Allows researchers to decide whether to consult the full work. Helps save time by providing a quick overview of research or articles.</p>\n\n<h4>5. Bibliographies</h4>\n<p>A list of books, articles, and other resources on a topic. Often appears at the end of a book, article, or research paper. Guides researchers to additional sources for further reading. Includes key information such as title, author, publisher, year, pages, and ISBN.</p>\n\n<h4>6. Directories</h4>\n<p>A list of names of people, organizations, and institutions with addresses. Useful for locating contacts, offices, or organizations. Examples: Lists of universities and higher institutions, names and addresses of women organizations in Nigeria.</p>\n\n<h4>7. Manuals</h4>\n<p>Provide step-by-step instructions on how to perform tasks or use resources. Can include guidelines for students, staff, or processes. Serves as a practical guide to operations or procedures.</p>\n\n<h4>8. Maps and Atlases</h4>\n<p><strong>Maps:</strong> Graphical representation of areas, showing locations, boundaries, and features. A geographical location of places.</p>\n\n<p><strong>Atlases:</strong> Collections of maps with additional descriptive information and sometimes photographs. Helps users understand geography, locations, and spatial relationships. Graphic information about vegetation, relief, and population can be found in atlases.</p>\n\n<h4>9. Gazetteers</h4>\n<p>A geographical dictionary. Provides information about places. Can be located in the Government Documents section.</p>\n\n<h4>10. Yearbooks/Almanacs</h4>\n<p>Provide basic data and statistics on topics such as education, health, sports, personalities, or professions. Published annually. Also called annuals. Example: To find last year's winners of the academy awards, consult an almanac.</p>\n\n<h4>11. Biographical References</h4>\n<p>Provide information about people, such as life events, achievements, and dates. Include specific historical or contemporary figures. Useful for research on individuals. Examples: Who's Who, Nigeria Who's Who.</p>\n\n<h4>12. Travel Guides</h4>\n<p>Provide information for travelers about destinations. An example of a geographical reference source.</p>\n\n<h4>13. Cartographic Materials</h4>\n<p>Also known as maps. A term used for some geographical reference sources.</p>\n\n<h4>14. Fact/Ready Reference Sources</h4>\n<p>Provide quick, factual information. Examples: Directories, handbooks.</p>\n\n<h4>15. Literature Search Tools</h4>\n<p>Tools used to find literature on a topic. Examples: Bibliographies, indexes.</p>\n\n<h2>Reference Services</h2>\n<p>Reference services refer to the activities carried out by library personnel to provide information to users, especially those who make use of reference sources. They involve professional assistance given to library users to help them locate, identify, and effectively use information resources in the library.</p>\n\n<h3>Components of Reference Services</h3>\n<ul>\n<li><strong>User Assistance and Instruction:</strong> Assisting users in locating materials on the library shelves; guiding users on how to use the library and its resources.</li>\n<li><strong>Assistance in Identifying Information Sources:</strong> Helping users identify appropriate library resources or reference sources needed to answer specific questions.</li>\n<li><strong>Provision of Factual Information:</strong> Providing brief and accurate answers to users' questions using reference materials.</li>\n</ul>\n\n<h3>Examples of Reference Services</h3>\n\n<h4>1. Selective Dissemination of Information (SDI)</h4>\n<p>A specialized reference service provided to users who do not have sufficient time to search for information themselves. The user consults a reference librarian, the librarian searches for relevant information on behalf of the user, and the information is later made available to the user. This service is commonly used by researchers and academics.</p>\n\n<h4>2. Literature Search</h4>\n<p>Searching through information storage devices and library resources to retrieve relevant information for users. The librarian conducts the search based on the user's request and compiles the required materials.</p>\n\n<h4>3. Exhibition and Display</h4>\n<p>Showcasing library materials, especially reference sources, to library users. Some libraries have special display rooms; others display materials at strategic locations such as the entrance of the library. This helps users become aware of available library resources.</p>\n\n<h4>4. Current Awareness Services</h4>\n<p>Keeping users informed about new developments in their fields. Includes Selective Dissemination of Information, publication of current contents, and new arrivals lists.</p>\n\n<h4>5. Notice Boards and Signages</h4>\n<p>Notice boards, signposts, and signages within the library are part of reference services. They provide information to users, direct users to appropriate sections of the library, and reduce the need for users to seek assistance from library staff.</p>\n\n<h4>6. Library Education and Library Talks</h4>\n<p>Educating users on how to effectively use library resources. This can be done through library orientation programmes, library talks, and media platforms such as radio programmes.</p>"
      },
      "serials": {
        "name": "Serials and Non-Print Resources",
        "content": "<h1>Serials and Non-Print Resources</h1>\n\n<h2>Serials</h2>\n\n<h3>Meaning of Serials</h3>\n<p>Serials are information resources published at regular intervals and intended to continue indefinitely. Unlike textbooks or novels, serials do not have a definite end. They are also referred to as periodicals.</p>\n\n<h3>Characteristics of Serials</h3>\n<ul>\n<li>They are published regularly (daily, weekly, monthly, quarterly, annually)</li>\n<li>They appear in volumes or editions</li>\n<li>They have no predetermined end to publication</li>\n<li>They have ISSN (International Standard Serial Number)</li>\n<li>They are often acquired through subscription</li>\n<li>The content in each volume differs from another</li>\n</ul>\n\n<p>ISSN stands for <strong>International Standard Serial Number</strong>. It is a unique identification number assigned to serial publications such as journals and magazines.</p>\n\n<h3>Types of Serials</h3>\n\n<h4>1. Magazines</h4>\n<p>Serial publications that deal with general-interest and less technical topics such as fashion, lifestyle, entertainment, and sports. They contain \"popular\" articles for general readership.</p>\n\n<h4>2. Newspapers</h4>\n<p>Serial publications that provide information on current affairs, politics, education, sports, and entertainment. They discuss both serious and light issues and focus on trending matters across various fields. A newspaper is a publication that is issued daily or weekly. Examples: The Punch, The Guardian.</p>\n\n<h4>3. Journals</h4>\n<p>Scholarly serial publications that contain academic and research-based information in specific disciplines. They are written by experts and are often peer-reviewed. A distinguishing factor of a journal is its volume and issue numbers. Journals are preferred for research because they contain up-to-date information of a technical nature. Most scholarly journals are published by academic institutions and professional bodies.</p>\n\n<h4>4. Newsletters</h4>\n<p>Serial publications that contain current information relating to individuals belonging to a specific profession or organization with common interests. They are circulated among members of the same organization or profession, focus on issues that concern members of the group, and are similar to newspapers but more limited in scope. Examples: school newsletters, organizational newsletters, professional association newsletters.</p>\n\n<h3>Factors Affecting the Production and Acquisition of Serials</h3>\n<ul>\n<li><strong>Demand by Library Users:</strong> High demand encourages production</li>\n<li><strong>Reputation of Authors:</strong> Publishers prefer authors with strong academic reputation</li>\n<li><strong>Reputation of Publishers:</strong> Well-known publishers are trusted</li>\n<li><strong>Subject Coverage:</strong> Adequate coverage of subject area</li>\n<li><strong>Cost-Benefit Consideration:</strong> Produced only when many users will benefit</li>\n<li><strong>Editorial Board:</strong> Competence of the editorial board influences quality</li>\n<li><strong>Availability of Alternative Formats:</strong> Electronic versions affect print production</li>\n<li><strong>Price of Serials:</strong> Cost affects production and acquisition</li>\n<li><strong>Place of Publication:</strong> Local content is often preferred</li>\n<li><strong>Constant change of serials title:</strong> A factor affecting production and acquisition</li>\n</ul>\n\n<h3>Problems of Serials</h3>\n<ul>\n<li>Constant changing of titles</li>\n<li>Change of technological development</li>\n<li>Authorship verification</li>\n</ul>\n\n<h2>Electronic Serials</h2>\n\n<h3>Criteria for Selecting Electronic Journals</h3>\n<ul>\n<li><strong>Quality of Content:</strong> Academic standard, accuracy, grammar</li>\n<li><strong>Accessibility:</strong> Ease of login, availability to multiple users</li>\n<li><strong>Cost:</strong> Affordability and sustainability</li>\n<li><strong>Technical Support:</strong> Availability of assistance for using electronic journals</li>\n<li><strong>Legal Issues:</strong> Copyright protection and usage rights</li>\n</ul>\n\n<h3>Advantages of Electronic Serials</h3>\n<ul>\n<li><strong>Usage Statistics:</strong> Help determine how often resources are used</li>\n<li><strong>Speed and Ease of Access:</strong> Open faster, easy to browse and search</li>\n<li><strong>Functionality:</strong> Easy navigation, search tools, hyperlinks</li>\n<li><strong>Rich Content:</strong> Can include text, images, videos, animations</li>\n<li><strong>Space Saving:</strong> No physical storage space required</li>\n<li><strong>Convenience:</strong> Can be accessed anywhere, anytime with internet</li>\n<li><strong>Can be accessed from outside the library</strong></li>\n</ul>\n\n<h3>Disadvantages of Electronic Serials</h3>\n<ul>\n<li><strong>Requirement of Special Devices:</strong> Need computers, tablets, or smartphones</li>\n<li><strong>Software Compatibility Issues:</strong> May require advanced software packages</li>\n<li><strong>High Cost of Devices:</strong> Devices are generally expensive</li>\n<li><strong>Power Supply Problems:</strong> Depend on electricity for access</li>\n<li><strong>Eye Strain:</strong> Prolonged use can cause eye strain</li>\n<li><strong>Lack of Reading Comfort:</strong> Not as comfortable as print</li>\n<li><strong>Unreliability and Short Lifespan:</strong> Links may expire</li>\n<li><strong>Rapid Technological Changes:</strong> New technologies require time and resources</li>\n<li><strong>Erratic power supply</strong> is a disadvantage</li>\n</ul>\n\n<h2>Non-Print Resources</h2>\n\n<h3>Audio-Visual Materials</h3>\n<p>Resources that appeal to sight and hearing. They include materials that users can watch, see, or listen to.</p>\n\n<p><strong>Types:</strong> Pictures and photographs, video recordings, audio recordings, projected and non-projected materials, television, video recordings, digital media, slides, motion pictures, transparencies.</p>\n\n<p><strong>Equipment:</strong> Television sets, video players, audio players, projectors, projection screens, monitors.</p>\n\n<p><strong>Advantages:</strong> Aid retention, good for group instruction, preservation, good for distance learning programmes, have large storage capacities.</p>\n\n<p><strong>Disadvantages:</strong> Erratic power supply, technology obsolescence.</p>\n\n<p><strong>Transparency</strong> is an example of a non-print form of recording knowledge.</p>\n\n<h3>Microforms</h3>\n<p>Reduced photographic images of printed pages that make it possible to house much more materials.</p>\n\n<h3>Miniature Storage Media</h3>\n<p>Examples: Flash drives, memory cards, USB drives, smart cards, CD-ROM, compact disk.</p>\n\n<p><strong>Personal Digital Assistant (PDA):</strong> Can be used to organize one's business or personal schedules, calendar, addresses, and book information.</p>\n\n<h3>Primary, Secondary, and Tertiary Sources</h3>\n\n<p><strong>Primary Sources:</strong> Original materials such as theses and dissertations, patents, scientific journals, research reports, original documents.</p>\n\n<p><strong>Secondary Sources:</strong> Created from primary materials interpreting original material. Examples: reviews, textbooks, bibliographies, indexes, abstracts.</p>\n\n<p><strong>Tertiary Sources:</strong> Compilations of primary and secondary sources.</p>"
      },
      "information_literacy_skills": {
        "name": "Information Literacy Skills",
        "content": "<h1>Information Literacy Skills</h1>\n\n<h2>Definition of Information Literacy</h2>\n<p>Information literacy is the ability to define an information need and satisfy it. It involves the skills combined in locating and retrieving information. Information literacy is also called information retrieval.</p>\n\n<p>Information literacy involves the abilities that require a person to identify when a particular information is needed, have the ability to locate the needed information, and use effectively and efficiently the information.</p>\n\n<h2>Aspects of Information Literacy</h2>\n<ul>\n<li>Media literacy</li>\n<li>Computer literacy</li>\n<li>Numerical literacy</li>\n<li>Cultural literacy</li>\n</ul>\n\n<h2>Parts of a Book</h2>\n\n<h3>Physical Parts</h3>\n<ul>\n<li><strong>Dust Jacket:</strong> A paper designed to cover a published book. Contains the blurb.</li>\n<li><strong>Binding:</strong> That part of a book which holds the printed sheets together.</li>\n<li><strong>Spine:</strong> The edge of the book that holds the printed papers. The part of a book which holds the printed sheets together.</li>\n<li><strong>Book Cover:</strong> The protective covering of a book.</li>\n<li><strong>Fly Leaf:</strong> A blank leaf found at the beginning and end of a book.</li>\n</ul>\n\n<h3>Bibliographic Parts</h3>\n<ul>\n<li><strong>Title Page:</strong> Contains the title, author, publisher, and place of publication.</li>\n<li><strong>Half Title Page:</strong> A page containing only the title of the book.</li>\n<li><strong>Verso Page (Copyright Page):</strong> Contains bibliographic details of a book including its copyright information. Contains the author's name, imprint, printer's name, date of copyright, name of copyright holder, book's number, Library of Congress catalogue number, previous editions.</li>\n<li><strong>Preface:</strong> States the author's intention for writing the book.</li>\n<li><strong>Table of Contents:</strong> Shows the topics in the book and where they can be found.</li>\n<li><strong>Appendices:</strong> Contain supporting but not too essential information in the book. Additional explanations and elaboration not essential to a text.</li>\n<li><strong>Glossary:</strong> List of specialized terms and their definitions.</li>\n<li><strong>Index:</strong> Alphabetical list of topics and page numbers where they appear.</li>\n<li><strong>Bibliography:</strong> List of sources consulted.</li>\n</ul>\n\n<h3>Features of Books</h3>\n<ul>\n<li>Chapter</li>\n<li>Edition</li>\n<li>Preface</li>\n</ul>\n\n<p>Books are the commonest forms of information carriers. A book is an information material containing 49 pages and above.</p>\n\n<h2>Study Skills</h2>\n<p>The term study skill is used for general approaches to learning skills for specific courses of study. Study skills include mnemonics which help in retention of information.</p>\n\n<h2>Library Rules and Regulations</h2>\n\n<h3>Rules for Library Users</h3>\n<ul>\n<li><strong>Student ID:</strong> Always display your student ID when entering the library. Entry may be denied if ID is not presented.</li>\n<li><strong>Borrowing and Using Library Materials:</strong> Library materials cannot leave the premises unless properly checked out. Return borrowed items in good condition and on time.</li>\n<li><strong>Personal Belongings:</strong> The library is not responsible for lost personal items. Keep valuables safe; avoid leaving bags unattended. Users normally keep their personal belongings in the cloak room.</li>\n<li><strong>No Food or Drink:</strong> Eating or drinking in the library is prohibited. Eating is one of the greatest offences in the library.</li>\n<li><strong>Mobile Phones:</strong> Set devices to silent mode. Avoid distractions and unnecessary calls while studying.</li>\n<li><strong>Noise and Conduct:</strong> Avoid making noise, having conversations, or disturbing other users. Noise making is a serious offence in the library. No sleeping, smoking, or inappropriate behavior.</li>\n<li><strong>Library Furniture and Equipment:</strong> Do not move furniture or equipment from their designated places. Use computers, e-resources, and other devices responsibly.</li>\n<li><strong>Library Staff Authority:</strong> Library staff may check bags and materials for security purposes. Comply with instructions and respect regulations to avoid penalties.</li>\n<li><strong>Safety Precautions:</strong> Do not bring hazardous items such as fire, liquids, or sharp objects into the library. Report damaged books or equipment responsibly.</li>\n<li><strong>Group discussion among readers</strong> is not allowed in the library.</li>\n</ul>\n\n<p>The user who loses any library material will pay the cost of the material plus an administrative charge of <strong>15%</strong>.</p>\n\n<h2>Information Retrieval Tools</h2>\n\n<h3>OPAC (Online Public Access Catalogue)</h3>\n<p>A computer-based system used to search for library materials. The acronym OPAC means <strong>Online Public Access Catalogue</strong>.</p>\n\n<h3>Library Catalogue</h3>\n<p>A systematic arrangement or list of bibliographic information. Contains list of all the library materials in the library. To find ALL books a library has on a subject, one needs to consult the subject catalogue.</p>\n\n<h3>SLAM</h3>\n<p>The library software used in FUTA Library.</p>\n\n<h3>Call Number</h3>\n<p>The combination of subject number and author number. Directs users to the exact location of a book on the shelf. Call number is alphanumeric.</p>\n\n<h2>Documentation and Referencing</h2>\n\n<h3>Citation Elements</h3>\n<p>Parts of a citation include: author, title, date of publication, place of publication, publisher's name.</p>\n\n<p>A common reference style used by students is <strong>APA (American Psychological Association)</strong>.</p>\n\n<p>In APA style, in-text citation consists of: author and year of publication.</p>\n\n<p><strong>Plagiarism</strong> is using someone's ideas in your paper but not crediting the source.</p>\n\n<h2>Internet and Social Media</h2>\n\n<h3>Internet Terms</h3>\n<ul>\n<li><strong>HTTP:</strong> Hypertext Transfer Protocol</li>\n<li><strong>WWW:</strong> World Wide Web</li>\n<li><strong>URL:</strong> Uniform Resource Locator</li>\n<li><strong>File Transfer Protocol (FTP):</strong> An internet standard that permits sharing of files with other computers on the internet.</li>\n</ul>\n\n<h3>Web Browsers</h3>\n<p>Examples: Mozilla Firefox, Opera Mini, Google Chrome, Internet Explorer.</p>\n\n<h3>Search Engines</h3>\n<p>Examples: Google, Hotbot, Excite, Yahoo, Bing.</p>\n\n<h3>Social Media</h3>\n<p>A website through which users create online communities to share information, ideas, personal messages, and other content.</p>\n\n<p><strong>Types:</strong> Facebook, Instagram, Twitter, LinkedIn, Google+, My Space, Flickr, YouTube.</p>\n\n<p><strong>Facebook:</strong> Founded by Mark Zuckerberg.</p>\n\n<p><strong>Twitter:</strong> A microblogging service. The maximum number of characters allowed on Twitter is 140. Hashtag (#) is used on Twitter.</p>\n\n<p><strong>Instagram:</strong> A photo and video sharing social networking website.</p>\n\n<p><strong>LinkedIn:</strong> The largest online professional network website. Used to share information of professional interest and career experiences.</p>\n\n<p><strong>Blog:</strong> Also called web log.</p>\n\n<p><strong>Podcasts:</strong> Digitized files that can be accessed with a website.</p>\n\n<p><strong>Disadvantages of Social Media:</strong> Facilitating deception, defamatory content, subjective norms.</p>\n\n<h3>Evaluating Internet Materials</h3>\n<p>Factors to consider when evaluating internet materials: credibility, objectivity, currency, accuracy, authority, support.</p>\n\n<p>When evaluating a website, factors to consider include: time of download, authority, currency, name of organization/institution the website is affiliated to.</p>\n\n<p>When a researcher cites an electronic source, he/she should have a copy of the material because internet-based materials are short-lived on the web.</p>\n\n<h2>FUTA Library Information</h2>\n<ul>\n<li><strong>Name:</strong> Albert Illemobade Library</li>\n<li><strong>Established:</strong> 1982</li>\n<li><strong>Opened to users:</strong> 1983</li>\n<li><strong>Relocated to present site:</strong> April 2006</li>\n<li><strong>Classification scheme used:</strong> Library of Congress Classification Scheme</li>\n<li><strong>Library software:</strong> SLAM</li>\n<li><strong>Opening hours:</strong> 8.00 am to 10.00 pm</li>\n<li><strong>Female cloakroom entry:</strong> Left hand side</li>\n<li><strong>Publications:</strong> Guide to the Library 2014-2018</li>\n<li><strong>FUTA Institutional Repository:</strong> Includes all publications collected from inception of the University and kept in one database</li>\n</ul>"
      },
      "report_writing": {
        "name": "Report Writing",
        "content": "<h1>Report Writing</h1>\n\n<h2>Introduction to Report Writing</h2>\n<p>Report writing is an important academic skill expected of university students. Unlike secondary school writing, academic reports follow specific formats and standards.</p>\n\n<h2>Meaning of a Report</h2>\n<p>A report is the presentation of facts and findings in a systematic and scientific manner. Reports are written to communicate information clearly and objectively.</p>\n\n<h2>Purpose of a Report</h2>\n<p>The major purposes of a report are:</p>\n<ul>\n<li>To inform</li>\n<li>To suggest new ideas</li>\n<li>To recommend solutions</li>\n<li>To present findings and possible courses of action</li>\n</ul>\n\n<h2>Types of Reports</h2>\n<p>Common types of reports include:</p>\n<ul>\n<li>Academic reports</li>\n<li>Business reports</li>\n<li>Feasibility reports</li>\n<li>Technical reports</li>\n</ul>\n\n<h2>Characteristics of a Good Report</h2>\n<ol>\n<li><strong>Formal Structure:</strong> A report must have a formal structure consisting of introduction, body, and conclusion.</li>\n<li><strong>Analytical Thinking:</strong> Report writing involves analytical and critical thinking. A report is written based on careful examination and interpretation of facts.</li>\n<li><strong>Careful Proofreading:</strong> A report must be carefully proofread to eliminate errors. Proper editing improves clarity, accuracy, and professionalism.</li>\n<li><strong>Neat Presentation:</strong> The presentation of facts and figures must be neat and well-organized. Clear formatting enhances readability and understanding.</li>\n<li><strong>Concise Sentences:</strong> Avoid long, rambling sentences. Keep sentences short and to the point.</li>\n<li><strong>Avoid Discursive Writing:</strong> Do not include irrelevant information or go off-topic.</li>\n<li><strong>Explain Abbreviations and Terms:</strong> Spell out terms before abbreviating. Avoid unnecessary jargon.</li>\n<li><strong>Clear Headings and Table Labels:</strong> Ensure headings are meaningful and easy to follow. Tables and figures should be numbered sequentially and labeled clearly.</li>\n</ol>\n\n<h2>Structure of a Report</h2>\n\n<ol>\n<li><strong>Title Page:</strong> Contains the title of the report, the author's name, institution, and date.</li>\n<li><strong>Acknowledgements:</strong> Optional section to appreciate contributions from individuals or organizations that assisted in the research.</li>\n<li><strong>Table of Contents:</strong> Lists the headings and subheadings of the report with page numbers for easy navigation.</li>\n<li><strong>Abstract/Summary:</strong> A brief summary of the report, highlighting the main objectives, methods, findings, and conclusions.</li>\n<li><strong>Introduction:</strong> Provides background information, objectives, and the purpose of the report.</li>\n<li><strong>Methodology/Materials and Methods:</strong> Explains the methods used to collect data, conduct experiments, or gather information.</li>\n<li><strong>Results/Findings:</strong> Presents the data collected, observations, and outcomes of the research or investigation.</li>\n<li><strong>Discussion/Analysis:</strong> Interprets the results, explains trends or patterns, and compares findings with previous studies.</li>\n<li><strong>Recommendations:</strong> Suggests possible actions or solutions based on the findings. In report writing, recommendations are based on findings.</li>\n<li><strong>Conclusion:</strong> Summarizes the main points and highlights the significance of the findings.</li>\n<li><strong>References/Bibliography:</strong> Lists all the sources consulted during the preparation of the report. A good report should have references.</li>\n<li><strong>Appendices (if necessary):</strong> Contains additional information such as questionnaires, raw data, or supplementary materials.</li>\n</ol>\n\n<p>The sections in a report are arranged in this order: Title page, abstract, introduction, body of report, conclusion, references.</p>\n\n<h2>Steps in Report Writing</h2>\n<p>The four steps involved in report writing are: <strong>Think, plan, write, and revise</strong>.</p>\n\n<h2>Technical Report Writing</h2>\n<p>A technical report should be written for the convenience of the intended readers, not for the writer's own understanding. The language used must be clear, precise, and comprehensible to the target audience.</p>\n\n<p>Technical reports may sometimes be position papers, where the writer reviews literature, evaluates findings, and presents their own conclusion or stance without conducting new experiments.</p>\n\n<h2>Executive Summary</h2>\n<p>An executive summary is used in a report to grab the attention of the reader.</p>\n\n<h2>Research and Reports</h2>\n\n<h3>Purpose of Research</h3>\n<ol>\n<li><strong>Answering Questions:</strong> Research helps to provide solutions or explanations to specific problems.</li>\n<li><strong>Solving Problems:</strong> The research process identifies and addresses challenges or gaps in knowledge.</li>\n<li><strong>Expanding Knowledge:</strong> Research extends the boundaries of existing knowledge and provides opportunities for future studies.</li>\n</ol>\n\n<h3>Statement of the Problem</h3>\n<p>The problem statement is the central focus of a report. It defines the issue being investigated, the purpose of the research, and the scope of the inquiry. A clear problem statement guides the selection of relevant literature and ensures the research addresses meaningful questions.</p>\n\n<h3>Determining the Scope of the Report</h3>\n<p>Before beginning research, it is important to define the scope of the report. This determines the boundaries of the research, prevents unnecessary or irrelevant data collection, and ensures that findings are relevant, current, and focused on the problem.</p>\n\n<h3>Selection of Information Resources</h3>\n<p>To write a high-quality report, select reliable and relevant information sources from online resources such as electronic journals, databases, and scholarly articles; primary sources including interviews, surveys, and experiments; and secondary sources like books, magazines, and reports. Evaluate the credibility, relevance, and timeliness of each source.</p>\n\n<h3>Sources of Information in Report Writing</h3>\n<ul>\n<li>The library</li>\n<li>Bibliographies</li>\n<li>Catalogues</li>\n</ul>"
      }
    }
  }
}